{
  "psi.book.page.basicBullet.0": "Самый простой тип Магического резонатора (одноименный предмет), хранящий заклинание скромный Магический резонатор. Когда хранящееся в нем заклинание используется, оно сразу же выполняется. Фокусом для этого типа резонатора является просто заклинатель. Стоимость его использования - это именно то, что указывает Программатор заклинаний. Нет необходимости в пересчете.",
  "psi.book.page.basicBullet.1": "Порох не нужен",
  "psi.book.entry.projectileBullet": "Векторный магический резонатор",
  "psi.book.page.projectileBullet.0": "Заклинание, наложенное с помощью Векторного магического резонатора , не выполняется немедленно. Вместо этого быстро движущийся снаряд, содержащий заклинание, выстреливает из конца УВЗ, из которого он сотворен. Этот снаряд действует как точка фокуса для его заклинания, выполняя его, когда снаряд сталкивается с чем-то.",
  "psi.book.page.projectileBullet.1": "Не совсем полдень",
  "psi.book.page.projectileBullet.2": "Снаряд заклинания не является физическим; вместо этого это тонкая обертка пси-энергии вокруг содержащегося в нем Заклинания (отсюда и дополнительная стоимость резонатора). Таким образом, он может существовать в мире до 30 секунд перед рассеиванием. Снаряд заклинания движется довольно быстро и может преодолевать расстояние более 200 блоков без посторонней помощи.",
  "psi.book.page.projectileBullet.3": "Сохраненное Заклинание активируется, если снаряд сталкивается с какими-либо блоками или объектами. В последнем случае, Селектор: Цель Атаки может использоваться для идентификации объекта, который был поражен. С другой стороны, если за это время снаряд никуда не попадает, Заклинание рассеивается, тратя впустую вложенную в него пси-энергию - так что цельтесь внемательно!",
  "psi.book.entry.loopcastBullet": "Зацикленный магический резонатор",
  "psi.book.page.loopcastBullet.0": "Заклинание, выполненное с помощью Зацикленного магического резонатора выполняется так же, как и на обычном Магическом резонаторе. Но неоднократно. Заклинание, выполненное из данного типа резонатора, выполняется снова и снова без остановки, четыре раза в секунду, пока УВЗ, которое его выполняет, не перестанет удерживаться в той же руке, или пока не будет выбрано другое Заклинание.",
  "psi.book.page.loopcastBullet.1": "А ты знаешь, что такое безумие?",
  "psi.book.page.loopcastBullet.2": "Фокусной точкой для заклинания, произведенного с помощью Зацикленного магического резонатор, является только заклинатель, и при каждом выполнении взимается полная стоимость энергии пси. Главное преимущество использования зацикленного резонатора над обычным заключается в регенерации энергии Пси.",
  "psi.book.page.loopcastBullet.3": "Когда вы используете заклинание (или когда вы получаете урон), ваша пси-энергия на мгновение остается в состоянии дисбаланса; она не может регенерировать, пока вы не сосредоточитесь и не стабилизируете её. Хотя это несложно, для достижения этой стабилизации требуется немного времени. Но когда вы используете из Зацикленный магический резонатор, эта задержка возникает только вначале - потом, резонатор не нарушает поток пси-энергии, позволяя ей восстанавливаться как обычно.",
  "psi.book.page.loopcastBullet.4": "Заклинание, выполненное из одного из этих резонаторов, может выполнять различные действия при каждом использовании. В частности, Селектор: Индекс циклов возвращает количество выполнений заклинания с момента его первого приведения. Таким образом, он возвращает 1 при первом выполнении Заклинания, 2 во второй раз и так далее.",
  "psi.book.page.loopcastBullet.5": "При использовании Оператор: Целочисленное деление и Оператор: Процент, эти резонаторы могут выполнять операции на обширные вычисления с легкостью.",
  "psi.book.entry.circleBullet": "Круговой магический резонатор",
  "psi.book.page.circleBullet.0": "Заклинание, выполненное из Кругового магического резонатора, выполняется последовательно ровно двадцать раз.  При первом применении Заклинания в точке, на которую смотрит заклинатель, создается Круг Заклинаний, который действует как Фокусная Точка для Заклинания. Этот круг выполняет заклинание четыре раза в секунду, пока через пять секунд не иссякнет пси-энергия.",
  "psi.book.page.circleBullet.1": "Расчет по стоимости",
  "psi.book.page.circleBullet.2": "Круг заклинания при первом применении вызывается на расстоянии до 32 блоков от позиции заклинателя или ближайшего блока, на который он смотрит (в зависимости от того, что ближе). Аналогично Зацикленному магическому резонатору, Селектор: Индекс циклов можно использовать и на Круговом магическом резонаторе (который возвращает число от 1 до 20 включительно).",
  "psi.book.page.circleBullet.3": "Круг заклинания высасывает всю необходимую ему пси-энергию при первом применении, поэтому его множитель стоимости составляет 1500%%. Однако его ненасытная стоимость не лишена выгоды; его компактный, автономный дизайн делает его чрезвычайно эффективным, позволяя ему выполнить заклинание 20 раз по цене 15. Для тех из вас, кто отслеживает, это полная скидка 25%% за выполнение.",
  "psi.book.page.circleBullet.4": "Круговой магический резонатор популярен среди новичков и опытных заклинателей благодаря своей универсальности и сохранению пси-энергии. Таким образом, есть несколько относительно распространенных приемов, используемых с Круговым магическим резонатором, в частности, которые больше нигде не встречаются.",
  "psi.book.page.circleBullet.5": "The Circlesync idiom, relatively simple to build, allows all twenty executions of the Spell to happen at once, allowing them to accumulate into a much grander effect than a single execution would alone. The 20-Bit Tower idiom has a slightly more difficult setup involving a Vector Ruler; but allows a Spell to only do something on a subset of its twenty executions.", //БРЕД
  "psi.book.subsec.circleBullet.6": "Circlesync", //БРЕД
  "psi.book.page.circleBullet.6": "The Circlesync idiom (pictured at right) uses Trick: Sleep at its core. When placed in the Spell, it delays each execution corresponding exactly to the time left until the final Trick activates. Any Tricks placed after the Trick: Sleep, then, execute simultaneously.", //БРЕД
  "psi.book.page.circleBullet.7": "When the stars align... ", //БРЕД
  "psi.book.subsec.circleBullet.8": "20-Bit Tower", //БРЕД
  "psi.book.page.circleBullet.8": "The 20-Bit Tower idiom is a rather advanced technique, rather technical in design. To use it, select a block with a Vector Ruler, then place some blocks (it doesn't matter what kind) in the twenty-block-high vertical space directly above the location you selected, then copy the code on the following page to the top of your Spell.", //БРЕД
  "psi.book.page.circleBullet.9": "Each block position in that vertical space represents one execution of the Spell; the bottommost location of the tower represents the first execution, the next location the second, and so on. An empty space in a tower represents \"DO execute on that iteration,\" and a block in that position tells the Spell \"DON'T.\" Finally, copy the code on the next page to the top of your Spell.", //БРЕД
  "psi.book.page.circleBullet.10": "Conditionally", //БРЕД
  "psi.book.entry.grenadeBullet": "Grenade Spell Bullet",
  "psi.book.page.grenadeBullet.0": "A Spell cast from a Grenade Spell Bullet, instead of executing immediately, is fired out the end of the УВЗ it was cast in a Spell Grenade. Unlike a Spell Projectile, though, a grenade is affected by gravity. It executes its contained Spell after exactly three seconds, no sooner and no later.",
  "psi.book.page.grenadeBullet.1": "Pull the trigger, not the pin",
  "psi.book.page.grenadeBullet.2": "A Spell Grenade is an intangible thin wrapper of Psi energy, created from the excess drawn by the Grenade Spell Bullet. The conjured grenade also acts as the Focal Point for the Spell when it executes. While its uses appear rather limited at first, a Spell Grenade can reach places a Spell Projectile can't (e.g. over a wall, or inside a hole).",
  "psi.book.page.grenadeBullet.3": "A Spell Grenade will record the last entity it comes into contact with. When its contained Spell executes, this entity can be accessed from Selector: Attack Target, if applicable.",
  "psi.book.entry.chargeBullet": "Charge Spell Bullet",
  "psi.book.page.chargeBullet.0": "A Spell cast from a Charge Spell Bullet, rather than executing immediately, is fired out the end of the УВЗ it's cast from in a Spell Charge, which obeys gravity just like a Spell Grenade. However, unlike a Spell Grenade, a Spell Charge can last up to five minutes, and only executes its Spell when specially told to do so by a Spell Detonator.",
  "psi.book.page.chargeBullet.1": "They build up",
  "psi.book.page.chargeBullet.2": "A Spell Charge is a stable shell of Psi energy around its contained Spell, acting as the Spell's Focal Point when executed. If the Spell Charge is never activated within its lifetime, it simply dissipates, fizzling the Spell within and wasting the invested Psi energy.",
  "psi.book.page.chargeBullet.3": "However, many Spell Charges in close proximity can all be activated at once by a single Spell Detonator (or Trick: Detonate), making them quite useful for mass effect. A Spell Charge will record the last entity it bumps into (or, as may occur, the last entity to step on it). When its contained Spell executes, this entity can be accessed from Selector: Attack Target, if applicable.",
  "psi.book.entry.mineBullet": "Mine Spell Bullet",
  "psi.book.page.mineBullet.0": "A Spell cast from a Mine Spell Bullet is fired out of the УВЗ it was cast in a Spell Mine. A Spell Mine obeys gravity and has a five-minute lifespan, and only executes its stored Spell once stepped on by someone (or something).",
  "psi.book.page.mineBullet.1": "Country roads...",
  "psi.book.page.mineBullet.2": "A Spell Mine's conditions for execution are rather finicky; a mine begins by staying on the ground and waiting to be stepped on. When one or more entities step on it, the mine doesn't trigger right away; instead it merely primes itself. When it's primed and there are no longer any entities atop it, then and only then will it execute its contained Spell.",
  "psi.book.page.mineBullet.3": "The entity that triggered the Spell (i.e. the last entity to step off the Spell Mine) is accessible from Selector: Attack Target. However, if a Spell Mine's activation conditions are never met within its lifetime, the mine will simply dissipate, fizzling its stored energy. So if you end up landing on a Spell Mine, waiting it out might just be preferable to knowing what the caster has in store for you.",
  "psi.book.entry.detonator": "Spell Detonator",
  "psi.book.page.detonator.0": "A Spell Detonator is crafted from two Iron Ingots, Psidust, and a Button. It serves exactly one function: when it's actuated ($(k:use)), it activates every single Spell Charge (and Exosuit Detonation Sensor) cast by you in a 32-block radius, instructing them to simultaneously execute their contained Spells.",
  "psi.book.page.detonator.1": "The first bomb",
  "psi.book.entry.exosuit": "Psimetal Exosuit",
  "psi.book.page.exosuit.0": "A Psimetal Exosuit is a suit of armor allowing you to seamlessly integrate Spell-casting into your everyday adventuring! Each piece of the Exosuit is crafted from two Psigems and some Psimetal, and is capable of casting a Spell when its respective trigger is activated.",
  "psi.book.page.exosuit.1": "The suits' Spells are cast with your УВЗ as a focus, so the usual УВЗ limits apply. Each piece of the Psimetal Exosuit can be loaded with up to three Магический резонатор in a УВЗ Assembler, though sadly, some Spell Bullet variants don't play well with the suit. A suit piece remembers the number of times it's successfully cast a Spell; this count can be accessed from Selector: Success Counter.",
  "psi.book.page.exosuit.2": "To select which Spell to use for a suit piece, craft an Exosuit Controller from Redstone Dust, Glass, and Psimetal. To use the Controller, hold the Psi master keybind. Use the right and left-mouse buttons to cycle through suit pieces.",
  "psi.book.page.exosuit.3": "It's no JARVIS, but it works",
  "psi.book.page.exosuit.4": "Once you've selected the suit piece you want to configure, choose one of the Магический резонатор that's displayed the same way you would with your УВЗ. Selecting the empty fourth slot disables that suit piece completely - no Spells will be cast even if its activation criteria are met.",
  "psi.book.page.exosuit.5": "A Psimetal Exosuit is slightly better than Iron Armor in strength and durability. All pieces of a suit will draw from their wearer's excess Psi energy to repair damage to themselves, a feat made possible by the Psigems used in their construction.",
  "psi.book.page.exosuit.6": "The Psimetal Exosuit Helmet is the most configurable of the bunch, casting its designated Spell whenever its contained Exosuit Sensor triggers. A Sensor attaches to and detaches from a Helmet in a crafting grid; a Helmet can only have one Exosuit Sensor attached at a time.",
  "psi.book.page.exosuit.7": "You hear a sound, turn around",
  "psi.book.page.exosuit.8": "The Psimetal Exosuit Chestplate casts its selected Spell whenever its user takes any form of damage. Selector: Attacker and Selector: Damage Taken can be used to identify the source and amount of damage, respectively.",
  "psi.book.page.exosuit.9": "Explosive Thorns",
  "psi.book.page.exosuit.10": "Psimetal Exosuit Leggings never stop casting their selected Spell. In fact, they do so once per УВЗ tick, which is a unit of time equal to 0.05 seconds. They're quite popular as \"better Loopcast Магический резонатор.\"",
  "psi.book.page.exosuit.11": "while(true) {}",
  "psi.book.page.exosuit.12": "Psimetal Exosuit Boots simply cast their designated Spell when their wearer jumps off the ground. No more, no less.",
  "psi.book.page.exosuit.13": "Jump Boost - er, Boots",
  "psi.book.entry.exosuitSensor": "Exosuit Sensors",
  "psi.book.page.exosuitSensor.0": "Exosuit Sensors are small devices designed to be embedded into larger pieces of armor (e.g. the Psimetal Exosuit Helmet), and to signal their containing armor when triggered. Each Sensor has a different condition for what triggers it.",
  "psi.book.page.exosuitSensor.1": "All Sensors are crafted from two Iron Ingots and two of Psimetal around a reagent; the reagent used determines the resulting Sensor's effect: the Light Sensor uses Glowstone Dust; the Heat Sensor uses a Fire Charge; the Stress Sensor uses a slice of Glistering Melon; the Water Sensor uses Prismarine Crystals; the Detonation Sensor uses Gunpowder.",
  "psi.book.page.exosuitSensor.2": "The Exosuit Light Sensor triggers once whenever its wearer moves into a dark area (i.e. an area that's dark enough to spawn monsters) from a non-dark area. It can be manually triggered in a dark area with a Trick: Conjure Light on a timer.",
  "psi.book.page.exosuitSensor.3": "Who turned out the lights?",
  "psi.book.page.exosuitSensor.4": "The Exosuit Heat Sensor triggers whenever its wearer catches fire. Trick: Fire Resistance or Trick: Torrent are good responses to this Sensor triggering, unless you really know what you're doing.",
  "psi.book.page.exosuitSensor.5": "We carry on",
  "psi.book.page.exosuitSensor.6": "The Exosuit Stress Sensor triggers when its wearer is low on health (specifically, if the wearer is at three hearts or less). Trick: Regeneration might be a good response to this issue.",
  "psi.book.page.exosuitSensor.7": "Don't panic",
  "psi.book.page.exosuitSensor.8": "The Exosuit Water Sensor triggers when its wearer touches water. With a bit of ingenuity, it can be triggered manually via Trick: Torrent.",
  "psi.book.page.exosuitSensor.9": "Make a splash",
  "psi.book.page.exosuitSensor.10": "The Exosuit Detonation Sensor triggers whenever a Spell Detonator is actuated within a 32-block radius, or when a Trick: Detonate is cast in the same area.",
  "psi.book.page.exosuitSensor.11": "At the push of a button",

  "psi.book.entry.vectorRuler": "Vector Ruler",
  "psi.book.page.vectorRuler.0": "A Vector Ruler can store an arbitrary vector, which can then be accessed from within a Spell at your convenience. It's made from Iron Ingots and a tip of Psidust.",
  "psi.book.page.vectorRuler.1": "Vectors rule",
  "psi.book.page.vectorRuler.2": "Tapping a Ruler on a block ($(k:use)) while crouching stores that block's position in the Ruler as a vector. Once a block's position is stored, tapping the Ruler without crouching on another block will store the offset between the two blocks. A Ruler's stored vector can be accessed with Selector: Vector Ruler.",
  "psi.book.page.vectorRuler.3": "If you happen to be carrying several Rulers at a time, Selector: Vector Ruler will return the stored value of the leftmost Ruler in your hotbar, or the highest Ruler in your inventory if your hotbar has none.",
  "psi.book.entry.spellDrive": "Spell Drive",
  "psi.book.page.spellDrive.0": "A Spell Drive, crafted from two ingots of Psimetal and a piece of Redstone Dust, can store a single Spell for later use. To store a Spell in a Spell Programmer onto a Drive, crouch and swipe ($(k:use)) an empty Drive over it. To copy a Spell back, crouch-swipe a Drive with a Spell stored over the Programmer.",
  "psi.book.page.spellDrive.1": "Build yourself a library",
  "psi.book.page.spellDrive.2": "To clear a stored Spell, crouch-swipe the Drive over any other block. A Drive with a stored Spell can be placed in a crafting grid with an empty Drive or Spell Bullet to copy its Spell onto the latter.",
  "psi.book.category.legacy": "Legacy Entries",
  "psi.book.category.legacy.desc": "These entries are a holdover from the days of Psi for 1.12 and below. As this book fills up with rewritten documentation, this section will shrink in size until all documentation is ported, when it'll vanish for good.",
  "psi.book.entry.vectors101": "Vectors 101",
  "psi.book.page.vectors101.0": "The manipulation of vectors is an essential component to Spell programming. Most vector operations are outlined here; the only missing piece is Оператор: Vector Cross Product.",
  "psi.book.page.vectors101.1": "The cross product of two vectors is a vector that is perpendicular to both. You can make use of this to get a vector that points to your side, by taking the cross product of the player's look vector and [0, 1, 0] (which you can create with Оператор: Vector Construct). ",
  "psi.book.entry.entities101": "Entities 101",
  "psi.book.page.entities101.0": "The manipulation of entities is an essential component to Spell programming. The most obvious entity to manipulate is you, the caster, via Selector: Caster. Other pieces, however, allow you to target other entities in the world. You can make use of those pieces to create Spells that affect other entities. Try using them with Trick: Add Motion to fling around others.",
  "psi.book.entry.blockworks": "Blockworks",
  "psi.book.page.blockworks.0": "Working with blocks is an essential skill for a mage. You can, of course, refer to a block's position via a vector, so knowledge of vectors is important to understand how to work with blocks. Two of the most basic block pieces in this group are Trick: Place Block and Trick: Break Block.",
  "psi.book.page.blockworks.1": "These both take a position vector, and respectively place and break a block at that position. Trick: Place Block uses the block to the right of your УВЗ in your hotbar for placing. Knowing the block position to break is easy; Оператор: Vector Raycast suffices.",
  "psi.book.page.blockworks.2": "However, placing a block is trickier: Оператор: Vector Raycast gives us the block the player is looking at. We can't place a block there - there already is one! To remedy that, we can combine our Оператор: Vector Raycast with the Оператор: Vector Axis Raycast piece, which gives us a vector representing the side of the block we're looking at. ",
  "psi.book.page.blockworks.3": "For example, if we're looking at the top of the block, it'll give us the axial vector [0, 1, 0]. We can use Оператор: Vector Sum to add it to our plain Raycast to tell us where our block will go! Оператор: Entity Axial Look is similar to Оператор: Entity Look, but returns a value snapped to one of the six axial vectors (e.g. if you're looking east, it returns [1, 0, 0]). Think of the \"Facing\" value in your F3 menu.",
  "psi.book.page.blockworks.4": "The other two Tricks available here are Trick: Place Block Sequence and Trick: Break Block Sequence. These Tricks break or place a line of blocks. Similarly to the standard break and place Tricks, they require a position to start off, but they also require another Vector, \"Target\", that defines the direction to operate in. So if \"Target\" is [0, 1, 0], it'll place or break blocks starting from the value of \"Position\" upwards.",
  "psi.book.page.blockworks.5": "The last component to these Tricks is \"Max\", this is a number constant for the maximum amount of blocks the Trick is allowed to break or place. Since the vector requirements aren't constant, this works as means of calculating the Potency and Cost of the Trick. The higher you set it, the more the Spell will cost. The last piece in this group is Оператор: Vector Project.",
  "psi.book.page.blockworks.6": "Vector Projection is a somewhat complex topic, so we'll only explain a potential uses for it below. Say you want to make a Spell that places blocks from your position in the world to the position you're looking at, but in a straight line aligned to the side of the block you're looking at (using Оператор: Vector Axis Raycast).",
  "psi.book.page.blockworks.7": "You start off by finding the vector that you want to place blocks along, so you can plug it into Trick: Place Block Sequence. If you're diagonal to the block, though, you may get something like [3, 2, 4]. That's not a straight line! We can use Оператор: Vector Project to project that into the axis of the side you're looking at, say, [0, 0, 1].",
  "psi.book.page.blockworks.8": "So our \"Vector A\" is [3, 2, 4] and our \"Vector B\" is [0, 0, 1]. Applying the projection leaves us with [0, 0, 4]. If our \"Vector B\", was, for example, [1, 0, 0], we'd get [3, 0, 0]. In general, when an axial vector is used for \"Vector B\", Оператор: Vector Project strips any components of A that are 0 in B, leaving you with a straight line. To put it all together, try making a Spell that brings down an 8 block high column, so you can \"treecapitate\"!",
  "psi.book.entry.movementAdvances": "Movement Advances",
  "psi.book.page.movementAdvances.0": "The basics of movement Tricks were covered when we talked about Trick: Add Motion. This group has pieces that improve on that idea. Trick: Blink simply teleports the target entity forwards in the direction they're looking in. A negative value will teleport the entity backwards.",
  "psi.book.page.movementAdvances.1": "Trick: Mass Blink does the same as Trick: Blink, but accepts an Entity List instead; each entity in the list is individually affected by the Trick. Trick: Mass Add Motion is similar; it's the Entity List version of Trick: Add Motion. Finally, Trick: Mass Exodus pulls every entity in an Entity List towards a given position, at the given speed. A negative speed will push them away instead. ",
  "psi.book.entry.blockMovement": "Block Movement",
  "psi.book.page.blockMovement.0": "The ability to move blocks isn't as important as the ability to break and place them, but happens to be quite useful nonetheless. Trick: Move Block takes a position for a block in the world and moves it in the target vector's direction, as if it were pushed by a piston. The target vector must be axial; if it isn't, the Trick will fail.",
  "psi.book.page.blockMovement.1": "On the other hand, Trick: Collapse Block causes a block to fall as if it were sand or gravel. Both these Tricks will fail to execute on complex blocks (those known as Tile Entities) and blocks that can't be harvested with Silk Touch. ",
  "psi.book.entry.elementalArts": "Elemental Arts",
  "psi.book.page.elementalArts.0": "What's a magic system without the ability to cast elemental Spells? This group contains Tricks for the four elements; for example, Trick: Smite summons a lightning bolt at the position it's told to.",
  "psi.book.page.elementalArts.1": "The group also contains Оператор: Random, a piece that will generate a random number between 0 (inclusive) and the number passed in (exclusive). This can be used alongside Loopcast or Spell Circle Spells in many ways. For example, one can create a Spell that would use Trick: Overgrow to mass bone meal a plantation. ",
  "psi.book.entry.trigonometry": "Trigonometry",
  "psi.book.page.trigonometry.0": "This group includes Операторs relevant to trigonometric functions. Constant: Pi is exactly what it says on the tin, a constant that gives you the value of =3.1415. This group includes elementary trigonometric operations as well: the sine and cosine functions, as well as their inverses (arcsine and arccosine).",
  "psi.book.page.trigonometry.1": "Additionally, Оператор: Vector Dot Product returns the dot product of two vectors: the product of the two vectors' magnitudes times the cosine of the angle between them. Using Оператор: Arc Cosine on the result will allow you to get the angle between two vectors. ",
  "psi.book.entry.smeltery": "Smeltery",
  "psi.book.page.smeltery.0": "The pieces in this group are function quite simply; they all smelt things into other things as if they had been put in a furnace. Trick: Smelt Item will cook a single dropped item in the world into its smelted counterpart.",
  "psi.book.page.smeltery.1": "Trick: Smelt Block will smelt a block in the world into its smelted version, provided that that smelted form's also a block. So Cobblestone can be smelted into Stone, and then into Smooth Stone, but a log won't smelt into Charcoal. ",
  "psi.book.entry.flowControl": "Flow Control",
  "psi.book.page.flowControl.0": "Flow Control is a somewhat complex subject. All the pieces here included allow a Spell to function in wildly different ways. However, understanding how to properly use these pieces requires knowledge of the very internals of the spellcasting system - have a read through this article for more information.",
  "psi.book.page.flowControl.1": "With that info under your belt, let's start off with Trick: Sleep. This piece causes the Spell from which it's cast to delay its execution for the number of ticks it receives. (A tick is a span of 0.05 seconds.) So if you wish to delay further processing of a Spell by half a second, you would use 10 as the \"Time\" parameter. Trick: Sleep does not add any Projection to your Spell, but does cost Potency.",
  "psi.book.page.flowControl.2": "Trick: Evaluate is a Trick that does absolutely nothing. Yes, you heard that right. This Trick does nothing. It doesn't add to any stats on your Spell, either. Its only practical use is to evaluate a value before a Trick: Sleep executes, allowing you to, for example, get the place an entity was before the Trick: Sleep triggered, for use later in the Spell.",
  "psi.book.page.flowControl.3": "Trick: Die, on the other hand, is a Flow Control piece in the proper sense of the term. It takes a Number parameter, and if that number's absolute value lies strictly below 1 (also exclusive), it fizzles the Spell right then and there. Any other values passed to the Trick will allow the Spell to continue on as usual. This piece doesn't cost Projection.",
  "psi.book.page.flowControl.4": "A very simple way to put Trick: Die to use is to couple it to Selector: Sneak Status, which conveniently returns 0 if the caster is sneaking and 1 if they're not. Why, it's almost as if they were made to be used together!",
  "psi.book.page.flowControl.5": "Constant: Wrapper allows you to use pieces that return Numbers for Tricks that would otherwise require Number Constants. As you should know by now, Number Constants fed to Tricks are used to calculate a Spell's stats (including Cost) before the Spellit's ever cast. Since these Constants are required at compile-time, simple Numbers that get evaluated at execution-time are clearly unusable here.",
  "psi.book.page.flowControl.6": "Constant: Wrapper gets around this by accepting two Numbers, a Constant and a non-Constant. The Constant passed to the piece will be the one used for Spell compilation calculations; but the non-Constant number will be the one used when the Spell is actually executed. The non-Constant Number's value will be capped at the value of the Constant during Spell execution, to prevent tomfoolery.",
  "psi.book.page.flowControl.7": "The execution-time Number has its sign changed to the sign of the Number Constant, so that the signs of both numbers match. If the Constant Number is 0, Constant: Wrapper always returns 0, regardless of input.",
  "psi.book.entry.blockConjuration": "Block Conjuration",
  "psi.book.page.blockConjuration.0": "This group includes pieces that do exactly as advertised: they conjure blocks. Trick: Conjure Block creates a Conjured Block, a semi-transparent solid block, at the given position. Conjured Blocks, if conjured with a \"Time\" parameter, can quietly break themselves after the specified time has elapsed.",
  "psi.book.page.blockConjuration.1": "If the \"Time\" parameter is used, it's specified in ticks (units of 0.05 seconds). Thus, if you want to make a block that disappears after half a second, set the \"Time\" parameter to 10 ticks. Trick: Conjure Light conjures a light source instead, one that can't be collided against.",
  "psi.book.page.blockConjuration.2": "Trick: Conjure Block Sequence functions much like Trick: Place Block Sequence, but creates Conjured Blocks instead. Both these pieces also include a \"Time\" parameter. Conjured Blocks are fragile, and will break instantly to any tool a player cares to swing at them.",
  "psi.book.entry.eidosManipulation": "Eidos Manpulation",
  "psi.book.page.eidosManipulation.0": "Eidos Tricks allow their caster to manipulate the space-time continuum in their favor. Trick: Eidos Reversal causes its caster to retrace their steps in reverse, at double speed, for the amount of time (in seconds) specified.",
  "psi.book.page.eidosManipulation.1": "Only one Eidos Reversal may be active at a time, and after a Reversal is cast, any subsequent Reversals can only reverse to the place where the last one ended. Sneaking will stop an ongoing Reversal. The other Trick piece of the group, Trick: Eidos Anchor creates an \"anchor\" for the caster.",
  "psi.book.page.eidosManipulation.2": "After the specified amount of time (in seconds), the caster will be warped back to their anchor's location. Multiple executions of Trick: Eidos Anchor can happen in quick succession, but only the last created anchor will activate.",
  "psi.book.page.eidosManipulation.3": "Finally, Selector: Eidos Changelog takes a single number parameter (let's call it n), and gives you the position in the n'th index of the Eidos Changelog starting from the end. In other words, it gives you a position vector to where you were n ticks ago. Trick: Eidos Reversal takes you backwards in the changelog, wiping out any locations that occur \"afterward.\" Trick: Eidos Anchor does not modify the changelog. ",
  "psi.book.entry.detectionDynamics": "Detection & Focus",
  "psi.book.page.detectionDynamics.0": "This group includes two types of pieces, as the title says: detection, and focus. To understand this, the concept of Slot Focus must be introduced.",
  "psi.book.page.detectionDynamics.1": "An already known example of Slot Focus is the family of Place Block style Tricks. These make use of the block directly to the right of your УВЗ. Slot Focus is the slot which Tricks like these will use. It can be relative (to the position of your УВЗ) or absolute, can only be in the hotbar and goes from 1 to 9.",
  "psi.book.page.detectionDynamics.2": "By default, whenever a Spell is cast, its value is \"Relative 1\", so it's 1 slot to the right of your УВЗ. If it was \"Relative -1\" it would be 1 slot to the left of your УВЗ. \"Absolute 3\" would be the third slot in your hotbar. It also loops around, so if you have your УВЗ on your last slot and the value is \"Relative 1\", it'll be your first slot.",
  "psi.book.page.detectionDynamics.3": "To set the focused slot, you can use Trick: Switch Focus Slot. This takes one of 2 parameters. Both are optional and mutually exclusive, and if you don't define any, it'll set the focus to the default of \"Relative 1\". If you choose to set the \"Position\" parameter, it'll set an Absolute value, whereas the \"Shift\" parameter will set a Relative value.",
  "psi.book.page.detectionDynamics.4": "This allows you to, for example, build things with different blocks based on the circumstance. This Trick only works for the current Spell cast, and the focus will reset the next time a Spell is cast (even if it's the same Spell). The other two pieces in the group are set in the \"detection\" area.",
  "psi.book.page.detectionDynamics.5": "First, Selector: Item Presence takes an optional slot number (if not set it'll default to your Focused Slot), and returns the amount of items in that slot, 0 if it's empty, of course.",
  "psi.book.page.detectionDynamics.6": "Lastly, Selector: Block Presence takes a vector, to be used as coordinates in the world, and finds the block there, the value returned is 0 if there's no block or a replaceable block (like tall grass), 1 if it's a non-solid block and 2 if it's a solid block. ",
  "psi.book.entry.memoryManagement": "Memory Management",
  "psi.book.page.memoryManagement.0": "This group introduces the ability for a Spell to store information persistently inside a УВЗ. A УВЗ can save vectors to be retrieved in future Spell executions. A УВЗ can store one vector for every three $(l:components/socket)Socket slots it has.",
  "psi.book.page.memoryManagement.1": "The number of vectors a УВЗ can store is known as the number of Memory Slots it has. This piece group includes two Spell Pieces, which can save and load vectors to and from a УВЗ's Memory Slots. Trick: Save Vector saves a vector to a designated Memory Slot, whereas Selector: Saved Vector retrieves the vector saved in the designated Memory Slot.",
  "psi.book.page.memoryManagement.2": "A УВЗ's Memory Slots are numbered starting from 1, so a УВЗ with 3 memory slots can save to slots 1, 2, and 3. Both Tricks in this group add Potency to Spells they're used in equal to the number of the slot used. For example, saving to or loading from slot 2 costs two Potency.",
  "psi.book.page.memoryManagement.3": "Trick: Save Vector has an imperfection: it \"locks\" the Memory Slot it saves to. This prevents either of the two pieces from interacting with that same Memory Slot later in the Spell. So if you need to load the value saved in a slot before you save something new to it, remember the rules of Flow Control to ensure the load happens before the save.",
  "psi.book.entry.secondaryOperators": "Secondary Операторs",
  "psi.book.page.secondaryOperators.0": "As its name implies, this group is composed of mathematical Операторs that aren't quite as important as the \"primary\" ones, like addition or subtraction. This group's just a mixed bag of all sorts of math or logic relates pieces that can be used to help with Spell creation. We'll separate the pieces in two sets to make them easier to explain.",
  "psi.book.page.secondaryOperators.1": "The first set is related to raising numbers to power, including pieces like Оператор: Square, Оператор: Power, Оператор: Square Root and even Оператор: Logarithm. Most of these operate exactly how you'd expect them to. Note that Оператор: Logarithm takes an optional Base argument; if no base is passed in, it'll default to base 10. Constant: e can also be used to get a natural logarithm.",
  "psi.book.page.secondaryOperators.2": "The second set of Операторs are related to logic. They're pieces that do rounding (to an integer). Оператор: Ceiling, Оператор: Floor and Оператор: Round round up, down, and to the closest integer, respectively. This group also includes Оператор: Min and Оператор: Max. These get the smallest and largest, respectively, of their parameters."
}